results/ryzen9-7950x-node0/arena-v3/e2e/h1-adaptive-1-load.txt
starting benchmark...
spawning thread #0: 16 total client(s). 500000 total requests
spawning thread #1: 16 total client(s). 500000 total requests
spawning thread #2: 16 total client(s). 500000 total requests
spawning thread #3: 16 total client(s). 500000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.29s, 177191.03 req/s, 764.48MB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 8.43GB (9048000704) total, 223.16MB (234000000) headers (space savings 0.00%), 8.14GB (8736000704) data
                     min         max         mean         sd        +/- sd
time for request:       47us      4.53ms       358us        88us    91.53%
time for connect:       87us     16.99ms     15.46ms      4.01ms    93.75%
time to 1st byte:     2.41ms     21.04ms     17.53ms      3.95ms    93.75%
req/s           :    2768.71     2815.04     2787.18       11.61    64.06%