results/ryzen9-7950x-node0/arena-v3/e2e/h1-adaptive-2-load.txt
starting benchmark...
spawning thread #0: 16 total client(s). 500000 total requests
spawning thread #1: 16 total client(s). 500000 total requests
spawning thread #2: 16 total client(s). 500000 total requests
spawning thread #3: 16 total client(s). 500000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.36s, 176115.09 req/s, 759.84MB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 8.43GB (9048000704) total, 223.16MB (234000000) headers (space savings 0.00%), 8.14GB (8736000704) data
                     min         max         mean         sd        +/- sd
time for request:       47us      4.65ms       361us        90us    91.00%
time for connect:       81us     21.12ms     19.34ms      5.01ms    93.75%
time to 1st byte:     2.28ms     23.49ms     21.33ms      4.88ms    93.75%
req/s           :    2751.90     2794.55     2764.57       10.98    64.06%