results/ryzen9-7950x-node0/arena-v3/e2e/h1-adaptive-3-load.txt
starting benchmark...
spawning thread #0: 16 total client(s). 500000 total requests
spawning thread #1: 16 total client(s). 500000 total requests
spawning thread #2: 16 total client(s). 500000 total requests
spawning thread #3: 16 total client(s). 500000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.25s, 177786.79 req/s, 767.05MB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 8.43GB (9048000704) total, 223.16MB (234000000) headers (space savings 0.00%), 8.14GB (8736000704) data
                     min         max         mean         sd        +/- sd
time for request:       46us      4.78ms       358us        88us    91.34%
time for connect:       84us     13.55ms     12.16ms      3.15ms    93.75%
time to 1st byte:     2.43ms     15.65ms     13.97ms      3.03ms    93.75%
req/s           :    2778.03     2810.26     2791.94        9.36    56.25%