results/ryzen9-7950x-node0/arena-v3/e2e/h1-arena-3-load.txt
starting benchmark...
spawning thread #0: 16 total client(s). 500000 total requests
spawning thread #1: 16 total client(s). 500000 total requests
spawning thread #2: 16 total client(s). 500000 total requests
spawning thread #3: 16 total client(s). 500000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.34s, 176437.48 req/s, 761.23MB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 8.43GB (9048000704) total, 223.16MB (234000000) headers (space savings 0.00%), 8.14GB (8736000704) data
                     min         max         mean         sd        +/- sd
time for request:       47us      5.43ms       359us        91us    90.99%
time for connect:       84us     15.03ms     13.63ms      3.53ms    93.75%
time to 1st byte:     3.31ms     18.32ms     16.17ms      3.40ms    93.75%
req/s           :    2756.95     2812.00     2783.61       15.70    59.38%