results/ryzen9-7950x-node0/arena-v3/e2e/h1-arena-prof-load.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #Warm-up started for thread #32.Warm-up started for thread #.

1.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
progress: 93% of clients started
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Application protocol: http/1.1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #1. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #1
0. Stopping all clients.
Stopped all clients for thread #0

finished in 20.02s, 175175.35 req/s, 755.78MB/s
requests: 3503507 total, 3503571 started, 3503507 done, 3503507 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3503507 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 14.76GB (15849866372) total, 390.92MB (409914531) headers (space savings 0.00%), 14.25GB (15303476528) data
                     min         max         mean         sd        +/- sd
time for request:       47us    149.98ms       372us       770us    99.56%
time for connect:        2us       218us       106us        57us    62.50%
time to 1st byte:   121.68ms    149.99ms    133.83ms      8.53ms    51.56%
req/s           :    2719.92     2757.00     2737.08        9.50    64.06%