results/ryzen9-7950x-node0/arena-v3/e2e/h2-adaptive-1-load.txt
starting benchmark...
spawning thread #0: 4 total client(s). 500000 total requests
spawning thread #1: 4 total client(s). 500000 total requests
spawning thread #2: 4 total client(s). 500000 total requests
spawning thread #3: 4 total client(s). 500000 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 5.15s, 388479.79 req/s, 1.31GB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 6.75GB (7244067941) total, 1.91MB (2000000) headers (space savings 90.00%), 6.68GB (7168315520) data
                     min         max         mean         sd        +/- sd
time for request:      255us      9.83ms      1.17ms       190us    98.54%
time for connect:       73us       443us       228us       128us    50.00%
time to 1st byte:     3.95ms      8.20ms      5.05ms      1.23ms    87.50%
req/s           :   24281.81    24717.19    24537.87      158.43    62.50%