results/ryzen9-7950x-node0/arena-v3/e2e/h2-adaptive-prof-load.txt
starting benchmark...
spawning thread #0: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #1: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #2: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #3: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #0.
Warm-up started for thread #1.
Warm-up started for thread #2.
progress: 25% of clients started
progress: 50% of clients started
progress: 75% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #Application protocol: h2c
1Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
.
Main benchmark duration is started for thread #1.
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1

finished in 20.00s, 372548.80 req/s, 1.26GB/s
requests: 7450976 total, 7451488 started, 7450976 done, 7450976 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 7450976 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 25.13GB (26986009695) total, 7.11MB (7450976) headers (space savings 90.00%), 24.87GB (26705352206) data
                     min         max         mean         sd        +/- sd
time for request:      511us    221.70ms      1.30ms      2.87ms    99.37%
time for connect:       16us       152us        80us        47us    50.00%
time to 1st byte:   192.13ms    204.64ms    198.24ms      6.12ms    87.50%
req/s           :   23243.20    23355.30    23283.97       37.77    62.50%